In [7]:
import pandas as pd

In [8]:
person = {
    "name": ["Juma", 'john', 'betty'],
    "age": [30, 21, 17],
    "gender": ["male", "male", "female"],
}

In [13]:
other_persons = [
    ['juma', 30, 'male'],
    ['john', 21, 'male'],
    ['mary', 25, 'female'],
    ['jane', 22, 'female'],
    ['betty', 17, 'female']
]

In [16]:
other_persons_table = pd.DataFrame(data=other_persons, columns=['name', 'age', 'gender'])
other_persons_table.describe()

            age
count   5.00000
mean   23.00000
std     4.84768
min    17.00000
25%    21.00000
50%    22.00000
75%    25.00000
max    30.00000

In [9]:
data = pd.DataFrame(data=person)

In [11]:
data

    name  age  gender
0   Juma   30    male
1   john   21    male
2  betty   17  female

In [12]:
data.age.mean()

22.666666666666668